#+TITLE: Container Most Water
#+DATE: <2026-06-12>
#+FILETAGS: :leetcode:two_pointers:arrays:
#+PROPERTY: header-args :results output :session *shared*
#+AUTHOR: Ken Rch

** Solution

#+begin_src python
from typing import List

class Solution:
    def maxArea(self, height: List[int]) -> int:
        n = len(height)
        left, right = 0, n - 1
        max_area = 0
        while left < right:
            min_height = min(height[left], height[right])
            area = min_height * (right - left)
            if area > max_area:
                max_area = area
            if height[left] > height[right]:
                right -= 1
            else:
                left += 1
        return max_area

height = [1,8,6,2,5,4,8,3,7]
print(Solution().maxArea(height))
# Output: 49

height = [1,1]
print(Solution().maxArea(height))
# Output: 1

height = [5,5,5,5]
print(Solution().maxArea(height))

height = [1,2,3,4,5]
print(Solution().maxArea(height))

#+end_src

#+RESULTS:
: 49
: 1
: 15
: 6


_Me_:

How does this solution look? If there are any edge-cases unaccounted for, give me
some hints.

_AI_:

The solution handles the main cases.  To check edge cases, try:

- All heights equal, e.g. =[5,5,5,5]=
- Strictly increasing, e.g. =[1,2,3,4,5]=
- Strictly decreasing, e.g. =[5,4,3,2,1]=
- A zero height, e.g. =[0,10,0]=

Does the algorithm still return the correct maximum in each?

